---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.GetEnumerator
source: html/d77dd5fd-44a5-0ced-65f1-b5d042299e82.htm
---
# Autodesk.Revit.DB.FaceArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.